git/bisect/README.md

# Table of Contents

1.  [What you will learn](#orga8d1395)
2.  [Example 1: Manually using git bisect](#orgda7fe80)
3.  [Example 2: Using automated testing with git bisect](#org741e85c)
4.  [What you learned](#org6872b78)



<a id="orga8d1395"></a>

# What you will learn

In this lesson, we will go over two common use cases of \`git bisect\`. The first use case involves manually looking for problems while doing a binary search. One might do this while looking over a few commits to find something simple. The second example involves automating both the testing and the searching in order to deal with the scenario of having multiple contributors working on multiple features, and not knowing where the problem might have arisen.


<a id="orgda7fe80"></a>

# Example 1: Manually using git bisect


<a id="org741e85c"></a>

# Example 2: Using automated testing with git bisect


<a id="org6872b78"></a>

# What you learned

